tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/plf/src/gd32vw55x_platform.c
/*!
    \file    gd32vw55x_platform.c
    \brief   WIFI reference platform initialization.

    \version 2023-07-20, V1.0.0, firmware for GD32VW55x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "app_cfg.h"
#ifdef CFG_WLAN_SUPPORT
#include "wlan_config.h"
#include "wifi_export.h"
#include "wifi_netlink.h"
#endif
#include "arch.h"
#include "gd32vw55x.h"
#include "systime.h"
#include "uart.h"
#include "rf_spi.h"
#include "hal_rf.h"
#include "rfi.h"
#include "dma.h"
#include "gd32vw55x_platform.h"
#include "wakelock.h"
#include "init_rom.h"
#include "nvds_flash.h"
#include "dbg_print.h"
#include "trng.h"
#include "trace_uart.h"
#include "log_uart.h"
#include "raw_flash_api.h"
#ifdef CFG_BLE_SUPPORT
#include "ble_export.h"
#endif

#ifdef CFG_BLE_HCI_MODE
#include "ble_uart.h"
#endif

#ifdef CONFIG_PLATFORM_FPGA
#define RTC_CLOCK_SOURCE_HXTAL_DIV_RTCDIV
#elif CONFIG_BOARD == PLATFORM_BOARD_32VW55X_START
#define RTC_CLOCK_SOURCE_IRC32K
#else
#define RTC_CLOCK_SOURCE_LXTAL
#endif

// Indicate WiFi is existed or not (CFG_WLAN_SUPPORT)
uint8_t wifi_exist_flag = 0;

extern void system_clock_config(void);

__INLINE void hw_crypto_engine_enable(void)
{
    rcu_periph_clock_enable(RCU_PKCAU);
    rcu_periph_clock_enable(RCU_CAU);
    rcu_periph_clock_enable(RCU_HAU);
}

__INLINE void hw_crypto_engine_disable(void)
{
    rcu_periph_clock_disable(RCU_PKCAU);
    rcu_periph_clock_disable(RCU_CAU);
    rcu_periph_clock_disable(RCU_HAU);
}

/*!
    \brief      set lpds preconfig
    \param[in]  settle_time: time want to set
    \param[out] none
    \retval     none
*/
void wifi_lpds_preconfig(uint8_t settle_time)
{
    /* set HXTAL settle time */
    PMU_RFPAR  &= (~PMU_RFPAR_TIM1_PAR);
    PMU_RFPAR  |= (settle_time & PMU_RFPAR_TIM1_PAR);
}

void wifi_lpds_enter(void)
{
    PMU_CTL1 |= PMU_CTL1_WIFI_LPDS_ON;
}

void wifi_lpds_exit(void)
{
    PMU_CTL1 &= (~PMU_CTL1_WIFI_LPDS_ON);
    while (((PMU_RFCTL & PMU_RFCTL_RF_STATE) >> 16) != 0x08);
    // wait wifi pmu active
    while ((PMU_CS1 & PMU_CS1_WPS_ACTIVE) != PMU_CS1_WPS_ACTIVE);
    // wait wifi module pmc idle
    while (!(REG32(0x4002392C) & BIT(31)));
}

bool wifi_is_not_idle(void)
{
    return (REG32(0x4002392C) & BITS(28, 30)) != BITS(28, 30);
}

bool wifi_hw_is_sleep(void)
{
#ifdef CFG_WLAN_SUPPORT
    return (((PMU_RFCTL & PMU_RFCTL_RF_STATE) == 0x00) // RF state is idle
            && ((PMU_CS1 & PMU_CS1_WPS_SLEEP) == PMU_CS1_WPS_SLEEP) // wifi module is sleep
            );
#else
    return true;
#endif
}

/*!
    \brief      clear exti line
    \param[in]  line_no: EXTI line number, refer to exti_line_enum
                only one parameter can be selected which is shown as below:
      \arg        EXTI_x (x=0..28): EXTI line x
    \param[out] none
    \retval     none
*/
static void exti_line_clear(exti_line_enum line_no)
{
    /* disable interrupt mask */
    exti_interrupt_disable(line_no);

    /* clear pending interrupt bit */
    if (SET == exti_flag_get(line_no)) {
        exti_interrupt_flag_clear(line_no);
    }
}

/*!
    \brief      enter deep sleep mode
    \param[in]  sleep_time: sleep time(0x0000-0x7fff)
    \param[out] none
    \retval     none
*/
void deep_sleep_enter(uint16_t sleep_time)
{
    exti_init(LOG_USART_RX_PIN_EXTI_LINE, EXTI_INTERRUPT, EXTI_TRIG_RISING);

    // Wifi module enter exit by self
    // exti_init(WLAN_WAKEUP_EXTI_LINE, EXTI_INTERRUPT, EXTI_TRIG_RISING);

    exti_init(RTC_WAKEUP_EXTI_LINE, EXTI_INTERRUPT, EXTI_TRIG_RISING);

    rtc_flag_clear(RTC_STAT_WTF);
    rtc_wakeup_disable();

#if defined(RTC_CLOCK_SOURCE_IRC32K)
    rtc_wakeup_timer_set(sleep_time * 2);  /* unit: 500us */
#else
    rtc_wakeup_timer_set(sleep_time * 5); /* unit: 200us */
#endif

    rtc_wakeup_enable();

    hw_crypto_engine_disable();
    trng_close(0);

#ifdef LOG_UART
    /* wait usart transmition complete */
    while(RESET == usart_flag_get(LOG_UART, USART_FLAG_TC));
#endif

#ifdef TRACE_UART
    /* wait usart transmition complete */
    while(RESET == usart_flag_get(TRACE_UART, USART_FLAG_TC));
#endif

#ifdef HCI_UART
    /* wait usart transmition complete */
    while(RESET == usart_flag_get(HCI_UART, USART_FLAG_TC));
#endif

    pmu_to_deepsleepmode(PMU_LDO_LOWPOWER, PMU_LOWDRIVER_ENABLE, WFI_CMD);
}

/*!
    \brief      exit deep sleep mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void deep_sleep_exit(void)
{
    GLOBAL_INT_STOP();
    if (rcu_system_clock_source_get() != RCU_SCSS_PLLDIG)
        system_clock_config();
    GLOBAL_INT_START();

    exti_line_clear(LOG_USART_RX_PIN_EXTI_LINE);
    // Wifi module clear exit by self
    // exti_line_clear(WLAN_WAKEUP_EXTI_LINE);
    exti_line_clear(RTC_WAKEUP_EXTI_LINE);

    #ifdef CFG_WLAN_SUPPORT
    if (wifi_netlink_status_get() == WIFI_RUNNING) {
        hw_crypto_engine_enable();
    }
    #endif

    if(RESET != rtc_flag_get(RTC_STAT_WTF)) {
        rtc_flag_clear(RTC_STAT_WTF);
    }
}

/*!
    \brief      enter deep sleep mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void wlan_exti_enter()
{
#ifdef CFG_LPS
    exti_init(WLAN_WAKEUP_EXTI_LINE, EXTI_INTERRUPT, EXTI_TRIG_RISING);
#endif
}

/*!
    \brief      exit deep sleep mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
void wlan_exti_exit(void)
{
#ifdef CFG_LPS
    exti_line_clear(WLAN_WAKEUP_EXTI_LINE);
#endif
}

/*!
    \brief      ble enter deep sleep mode
*/
void ble_exti_enter(void)
{
    exti_init(BLE_WAKEUP_EXTI_LINE, EXTI_INTERRUPT, EXTI_TRIG_RISING);
}

/*!
    \brief      ble exit deep sleep mode
*/
void ble_exti_exit(void)
{
    exti_line_clear(BLE_WAKEUP_EXTI_LINE);
}

void ble_pmu_config(uint32_t enable)
{
    if (enable) {
        /* if ble is sleep, config power on */
        if (pmu_flag_get(PMU_FLAG_BLE_SLEEP) == SET)
            pmu_ble_control(PMU_BLE_WAKE);
        /* wait active */
        while (pmu_flag_get(PMU_FLAG_BLE_ACTIVE) != SET);
    } else {
        /* if ble is active, config power off */
        if (pmu_flag_get(PMU_FLAG_BLE_ACTIVE) == SET)
            pmu_ble_control(PMU_BLE_SLEEP);
        /* wait sleep */
        while (pmu_flag_get(PMU_FLAG_BLE_SLEEP) != SET);
    }
}

void ble_wait_sleep_exit(uint32_t timeout_ms)
{
#ifdef CFG_BLE_SUPPORT
    uint64_t start;

    if (timeout_ms > 0) {
        start = get_sys_local_time_us();
        while (ble_core_is_deep_sleep() && (get_sys_local_time_us() < start + timeout_ms * 1000));
    } else {
        while (ble_core_is_deep_sleep());
    }
#endif
}

