tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/plf/src/gd32vw55x_platform.c
void ble_rcc_config(void)
{
    /* ble enable */
    rcu_periph_clock_enable(RCU_BLE);

    /* ble reset */
    rcu_periph_reset_enable(RCU_BLERST);
    rcu_periph_reset_disable(RCU_BLERST);
}

void ble_power_status_en(void)
{
    pmu_interrupt_enable(PMU_INT_BLE_POWER_FALL);
    pmu_interrupt_enable(PMU_INT_BLE_POWER_RISE);
}

uint32_t ble_power_status_rise_status(void)
{
    return pmu_interrupt_flag_get(PMU_INT_FLAG_BLE_POWER_RISE) == SET;
}

void ble_power_status_rise_clear(void)
{
    pmu_interrupt_flag_clear(PMU_INT_FLAG_RESET_BLE_POWER_RISE);
}

uint32_t ble_power_status_fall_status(void)
{
    return pmu_interrupt_flag_get(PMU_INT_FLAG_BLE_POWER_FALL) == SET;
}

void ble_power_status_fall_clear(void)
{
    pmu_interrupt_flag_clear(PMU_INT_FLAG_RESET_BLE_POWER_FALL);
}

void ble_external_wakeup(void)
{
    pmu_ble_wakeup_request_enable();
}

void ble_external_wakeup_clear(void)
{
    pmu_ble_wakeup_request_disable();
}

uint32_t ble_sleep_measure_clock_get(void)
{
#ifdef CONFIG_PLATFORM_FPGA
    return rcu_clock_freq_get(CK_SYS);
#else
    return rcu_clock_freq_get(CK_APB1);
#endif
}

void ble_irq_enable(void)
{
    /* exti interrupt wake up the cpu from deep sleep state */
    eclic_irq_enable(BLE_WKUP_IRQn, 12, 0);

    /* ble ps requires low interrupt processing latency for pmu, the interrupt priority is higher than that of OS interrupt masking(configMAX_SYSCALL_INTERRUPT_PRIORITY) */
    eclic_irq_enable(BLE_POWER_STATUS_IRQn, 11, 0);

    eclic_irq_enable(BLE_SW_TRIG_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_SW_TRIG_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_HALF_SLOT_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_HALF_SLOT_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_SLEEP_MODE_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_SLEEP_MODE_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_ENCRYPTION_ENGINE_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_ENCRYPTION_ENGINE_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_FINE_TIMER_TARGET_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_FINE_TIMER_TARGET_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_STAMP_TARGET1_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_STAMP_TARGET1_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_STAMP_TARGET2_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_STAMP_TARGET2_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_STAMP_TARGET3_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_STAMP_TARGET3_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_FREQ_SELECT_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_FREQ_SELECT_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_ERROR_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_ERROR_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(BLE_FIFO_ACTIVITY_IRQn, 8, 0);
    ECLIC_SetTrigIRQ(BLE_FIFO_ACTIVITY_IRQn, ECLIC_POSTIVE_EDGE_TRIGGER);
}

void ble_irq_disable(void)
{
    eclic_irq_disable(BLE_WKUP_IRQn);

    eclic_irq_disable(BLE_POWER_STATUS_IRQn);

    eclic_irq_disable(BLE_SW_TRIG_IRQn);

    eclic_irq_disable(BLE_HALF_SLOT_IRQn);

    eclic_irq_disable(BLE_SLEEP_MODE_IRQn);

    eclic_irq_disable(BLE_ENCRYPTION_ENGINE_IRQn);

    eclic_irq_disable(BLE_FINE_TIMER_TARGET_IRQn);

    eclic_irq_disable(BLE_STAMP_TARGET1_IRQn);

    eclic_irq_disable(BLE_STAMP_TARGET2_IRQn);

    eclic_irq_disable(BLE_STAMP_TARGET3_IRQn);

    eclic_irq_disable(BLE_FREQ_SELECT_IRQn);

    eclic_irq_disable(BLE_ERROR_IRQn);

    eclic_irq_disable(BLE_FIFO_ACTIVITY_IRQn);
}

void ble_power_on(void)
{
    /* ble power on */
    ble_pmu_config(1);
    /* ble enable and reset */
    ble_rcc_config();
    /* ble ps enable, ble core sleep will generate power status interrupt */
    ble_power_status_en();
}

void ble_power_off(void)
{
    /* ble power off */
    ble_pmu_config(0);
    rcu_periph_clock_disable(RCU_BLE);
    ble_wakelock_release();
}

void hw_crc32_enable(void)
{
    rcu_periph_clock_enable(RCU_CRC);
    crc_data_register_reset();
}

uint32_t hw_crc32_single(uint32_t data)
{
    return crc_single_data_calculate(data);
}

void hw_crc32_disable(void)
{
    rcu_periph_clock_disable(RCU_CRC);
}

/*!
    \brief      acquire ble wakelock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ble_wakelock_acquire(void)
{
    sys_wakelock_acquire(LOCK_ID_BLE);
}

/*!
    \brief      release ble wakelock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ble_wakelock_release(void)
{
    sys_wakelock_release(LOCK_ID_BLE);
}

#ifdef CFG_WLAN_SUPPORT
/*!
    \brief      acquire wifi wakelock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void wifi_wakelock_acquire(void)
{
    sys_wakelock_acquire(LOCK_ID_WLAN);
}

/*!
    \brief      release wifi wakelock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void wifi_wakelock_release(void)
{
    sys_wakelock_release(LOCK_ID_WLAN);
}

#ifdef CONFIG_PLATFORM_ASIC
void wifi_pmu_config(void)
{
    /* PMU enable WLAN power */
    pmu_wifi_power_enable();
    /* wlan is in sleep state by default, set wlan_wake command to PMU to switch wlan power state */
    pmu_wifi_sram_control(PMU_WIFI_WAKE);

    /* polling PMU to confirm wlan is switched from sleep state */
    while (pmu_flag_get(PMU_FLAG_WIFI_ACTIVE) != SET) {
        pmu_wifi_sram_control(PMU_WIFI_WAKE);
        systick_udelay(50);
    }
}

void wifi_rcc_config(void)
{
    /* WIFI clock enable */
    rcu_periph_clock_enable(RCU_WIFI);

    /* WIFIRUN clock enable */
    rcu_periph_clock_enable(RCU_WIFIRUN);

    /* WIFI reset */
    rcu_periph_reset_enable(RCU_WIFIRST);
    rcu_periph_reset_disable(RCU_WIFIRST);
}

#else  /* CONFIG_PLATFORM_ASIC */

void wifi_pmu_config(void)
{
    /* PMU enable WLAN power */
    REG32(PMU + 0x08) |= BIT(1);
    /* wlan is in sleep state by default, set wlan_wake command to PMU to switch wlan power state */
    REG32(PMU + 0x08) |= BIT(3);

