tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/plf/src/gd32vw55x_platform.c
    /* polling PMU to confirm wlan is switched from sleep state */
    //while ((REG32(PMU + 0x0c) & BIT(2)) == 0) {
    //}
}

void wifi_rcc_config(void)
{
    /* wlan enable, wlan run enable */
    REG32(RCU + 0x30) |= 0x00006000;

    /* pwr */
    REG32(0x40007080) = 0x00040000;
}


void wifi_pll_reset(void)
{
    REG32(RCU + 0xa0) |= 0x00180000;
    REG32(RCU + 0xa0) &= (~0x00180000);
}

#endif  /* CONFIG_PLATFORM_ASIC */

void wifi_irq_enable(void)
{
    /* exti interrupt wake up the cpu from deep sleep state */
    eclic_irq_enable(WIFI_WKUP_IRQn, 12, 0);

    eclic_irq_enable(WIFI_INT_IRQn, 8, 0);
#ifdef GD32VW55X_WIFI_MUL_INTS
    eclic_irq_enable(WIFI_PROT_IRQn, 8, 0);
    eclic_irq_enable(WIFI_INTGEN_IRQn, 8, 0);
    eclic_irq_enable(WIFI_TX_IRQn, 8, 0);
    eclic_irq_enable(WIFI_RX_IRQn, 8, 0);
#endif
    eclic_irq_enable(LA_IRQn, 8, 0);

    // configure the interrupt controller
    intc_init();
}

void wifi_irq_disable(void)
{
    intc_deinit();

    eclic_irq_disable(WIFI_WKUP_IRQn);

    eclic_irq_disable(WIFI_INT_IRQn);
#ifdef GD32VW55X_WIFI_MUL_INTS
    eclic_irq_disable(WIFI_PROT_IRQn);
    eclic_irq_disable(WIFI_INTGEN_IRQn);
    eclic_irq_disable(WIFI_TX_IRQn);
    eclic_irq_disable(WIFI_RX_IRQn);
#endif
    eclic_irq_disable(LA_IRQn);
}

int wifi_power_on(void)
{
    // enable HardWare accelerate engine related RCU clock
    hw_crypto_engine_enable();

    // Enable wifi
    wifi_pmu_config();
    wifi_rcc_config();

    //wifi_irq_enable();

    return 0;
}

void wifi_power_off(void)
{
    /* disable wifi interrupts */
    //wifi_irq_disable();

    /* RCC disable wifi clock */
    rcu_periph_clock_disable(RCU_WIFI);
    rcu_periph_clock_disable(RCU_WIFIRUN);

    /* PMU set wifi to sleep state */
    pmu_wifi_sram_control(PMU_WIFI_SLEEP);
}

void wifi_led_config(void)
{
    /* enable the LED GPIO clock */
    rcu_periph_clock_enable(RCU_GPIOC);
    /* configure LED GPIO pin */
    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LED_RUN);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_MAX, LED_RUN);
    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LED_RX);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_MAX, LED_RX);
    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LED_SLEEP);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_MAX, LED_SLEEP);

    //LED_ON(LED_RUN);
}
#endif

#ifdef CONFIG_PLATFORM_ASIC
__INLINE void rf_rcc_config(void)
{
    /* polling RF DPLL ready */
    while ((RCU_CTL & RCU_CTL_PLLDIGSTB) == 0) {
    }

    /* RF clock enable */
    rcu_periph_clock_enable(RCU_RF);

    /* RF reset */
    rcu_periph_reset_enable(RCU_RFRST);
    rcu_periph_reset_disable(RCU_RFRST);

    /* RFI clock enable */
    rcu_periph_clock_enable(RCU_RFI);

    /* RFI reset */
    rcu_periph_reset_enable(RCU_RFIRST);
    rcu_periph_reset_disable(RCU_RFIRST);
}
#else /* CONFIG_PLATFORM_ASIC */
__INLINE void rf_rcc_config(void)
{
    /* RF PU & RF reset(bit29-30)*/
    REG32(RCU + 0x30) |= 0x60000000;

    // Wait RF PU stable
    systick_udelay(50);
}
#endif /* CONFIG_PLATFORM_ASIC */

void rf_pmu_par_config(void)
{
    /* set PMU_RFPAR_T1 to 0 so that RF XTAL up time is 1ms */
    PMU_RFPAR = PMU_RFPAR  & (~PMU_RFPAR_TIM1_PAR);
}

int rf_power_on(void)
{
#ifdef CONFIG_PLATFORM_FPGA
    // Enable SPI
    rf_spi_config();
#endif

    // Reset and enable RF PU
    rf_rcc_config();

    // rf reg adjuct for different crystal freq, rf pll enable is in system_clock_config().
    rf_enable_pll(HXTAL_VALUE / 1000000);

    rf_pmu_par_config();

    // init rfi
    rfi_init();

    // Add the initial configuration of the RF/ADC/DAC/etc.
    hal_init_rf();

    return 0;
}

void rf_power_off(void)
{
#ifdef CONFIG_PLATFORM_ASIC
    rcu_periph_clock_disable(RCU_RFI);
    rcu_periph_clock_disable(RCU_RF);
#endif /* CONFIG_PLATFORM_ASIC */
}

__IO uint32_t prescaler_a = 0, prescaler_s = 0;

/*!
    \brief      configure RTC pre-configure
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void rtc_pre_config(void)
{
    #if defined(RTC_CLOCK_SOURCE_IRC32K)
        rcu_osci_on(RCU_IRC32K);
        rcu_osci_stab_wait(RCU_IRC32K);
        rcu_rtc_clock_config(RCU_RTCSRC_IRC32K);

        prescaler_s = 0x3E7;  // 0x13F;
        prescaler_a = 0x1F;  // 0x63;
    #elif defined(RTC_CLOCK_SOURCE_LXTAL)
        rcu_osci_on(RCU_LXTAL);
        rcu_osci_stab_wait(RCU_LXTAL);
        rcu_rtc_clock_config(RCU_RTCSRC_LXTAL);

        prescaler_s = 0x3FF; // 1024
        prescaler_a = 0x1F;  // 32
    #elif defined(RTC_CLOCK_SOURCE_HXTAL_DIV_RTCDIV)
        rcu_osci_on(RCU_HXTAL);
        rcu_osci_stab_wait(RCU_HXTAL);
        prescaler_s = 0x3E7;  // 999;
        prescaler_a = 0x13;  // 19;
        /* HW fix pre-scaler 100*/
        /* rtc clock selection as (HXTAL/25)/100 = 20KHZ */
        rcu_rtc_clock_config(RCU_RTCSRC_HXTAL_DIV_RTCDIV);
        rcu_rtc_div_config(RCU_RTC_HXTAL_DIV25);
    #else
    #error RTC clock source should be defined.
    #endif  /* RTC_CLOCK_SOURCE_IRC32K */

    rcu_periph_clock_enable(RCU_RTC);
    rtc_register_sync_wait();
}

/*!
    \brief      get rtc 32k time
    \param[in]  cur_time: pointer to the input structure
                  tv_sec: second of current time
                  tv_msec: miliseconds of current time
     \param[in]  is_wakeup: wakeup state
    \param[out] none
    \retval     none
*/
void rtc_32k_time_get(struct time_rtc *cur_time, uint32_t is_wakeup)
{
    rtc_parameter_struct rtc_time;
    uint32_t second;
    uint32_t sub_second;

    if (is_wakeup) {
        rtc_register_sync_wait();
    }

    /* If directly call rtc_subsecond_get() function to get sub-second,
       it would unlock RTC_TIME and RTC_DATE by reading the RTC_DATE at the end.
       This could not protect the situation where we read the time just 59.999.
       as RTC_TIME may be updated to 00 at the next clock.
    */
    // Firstly we read RTC_SS to lock RTC_TIME and RTC_DATE,
    sub_second = RTC_SS;

    /* Then, we must call rtc_current_time_get here to read RTC_TIME && RTC_DATA
       and unlock them by the way
    */
    rtc_current_time_get(&rtc_time);

    second = ((rtc_time.second >> 4) * 10) + (rtc_time.second & 0x0f);

    cur_time->tv_sec = second;
    /* The sub-second(unit ms) calculated formula is as follow:
          sub_second = 1000*((float)(prescaler_s - RTC_SS)/(float)(prescaler_s + 1))
       We can use the simple formula if prescaler_s = 999.
    */
#ifdef RTC_CLOCK_SOURCE_LXTAL
    sub_second = 1000*((float)(prescaler_s - RTC_SS)/(float)(prescaler_s + 1));
#endif
    cur_time->tv_msec = prescaler_s - sub_second;
}

/*!
    \brief      trigger RF PLL calculation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rf_pll_cal_trigger(void)
{
    RCU_CFG1 &= (~RCU_CFG1_RFPLLCALEN);
    RCU_CFG1 |= RCU_CFG1_RFPLLCALEN;
}

/*!
    \brief      setup rtc
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void rtc_setup(void)
{
    rtc_parameter_struct rtc_initpara;

    /* setup RTC time value */
    uint32_t tmp_hh = 0, tmp_mm = 0, tmp_ss = 0;

    rtc_initpara.factor_asyn = prescaler_a;
    rtc_initpara.factor_syn = prescaler_s;
    rtc_initpara.year = 0x20;
    rtc_initpara.day_of_week = RTC_MONDAY;
    rtc_initpara.month = RTC_NOV;
    rtc_initpara.date = 0x2;
    rtc_initpara.display_format = RTC_24HOUR;
    rtc_initpara.am_pm = RTC_AM;
    rtc_initpara.hour = tmp_hh;
    rtc_initpara.minute = tmp_mm;
    rtc_initpara.second = tmp_ss;

    /* RTC current time configuration */
    if (ERROR == rtc_init(&rtc_initpara)) {
        printf("RTC time configuration failed!\r\n");
    } else {
        rtc_current_time_get(&rtc_initpara);
    }
}

/*!
    \brief      configure rtc 32k clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void rtc_32k_config(void)
{
    /* enable access to RTC registers in Backup domain */
    rcu_periph_clock_enable(RCU_PMU);
    pmu_backup_write_enable();

    rtc_pre_config();
    // /* 32K clock selection */
    // REG32(RCU + 0x70) = (REG32(RCU + 0x70) & 0xfffffcff) | 0x00000200;

    rtc_deinit();
    rtc_setup();

    /* clear wakeup timer occurs flag */
    rtc_flag_clear(RTC_STAT_WTF);
    /* RTC wakeup configuration */
    rtc_interrupt_enable(RTC_INT_WAKEUP);
#if defined(RTC_CLOCK_SOURCE_IRC32K)
    /* set wakeup clock as RTCCK_DIV16 */
    rtc_wakeup_clock_set(WAKEUP_RTCCK_DIV16);
#else
    /* set wakeup clock as WAKEUP_RTCCK_DIV4 = RTC CLOCK / 4 = 5KHZ*/
    rtc_wakeup_clock_set(WAKEUP_RTCCK_DIV4);
#endif
}

static void platform_uart_init()
{
    uart_driver_init();

#ifdef LOG_UART
    log_uart_init();
#endif

