tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/plf/src/gd32vw55x_platform.c
#ifdef CFG_BLE_HCI_MODE
    ble_uart_init();
#endif

#ifdef TRACE_UART
    trace_uart_init();
#endif
}

static void eclic_config(void)
{
    // disable all interrupts
    eclic_global_interrupt_disable();
    eclic_priority_group_set(ECLIC_PRIGROUP_LEVEL4_PRIO0);

    /* CLIC_INT_SFT,CLIC_INT_TMR set trigger mode */
    ECLIC_SetTrigIRQ(CLIC_INT_SFT, ECLIC_POSTIVE_EDGE_TRIGGER);
    ECLIC_SetTrigIRQ(CLIC_INT_TMR, ECLIC_POSTIVE_EDGE_TRIGGER);

    eclic_irq_enable(USART0_IRQn, 8, 0);

    eclic_irq_enable(UART1_IRQn, 8, 0);

#ifndef CFG_MATTER
    /* set trigger mode and interrupt level, same as arm priority. a larger interrupt priorities value in riscv indicates a higher priority */
    eclic_irq_enable(UART2_IRQn, 8, 0);
#endif

    /* exti interrupt wake up the cpu from deep sleep state, TODO: uart exti interrupts processing time is large, and the priority is lower */
    eclic_irq_enable(RTC_WKUP_IRQn, 12, 0);
    eclic_irq_enable(EXTI5_9_IRQn, 9, 0);

#ifdef TRACE_UART_DMA
    eclic_irq_enable(TRACE_DMA_IRQ_NUM, 8, 0);
#endif

#ifdef HCI_UART_RX_DMA
    eclic_irq_enable(HCI_DMA_IRQ_NUM, 8, 0);
#endif

}

void platform_init(void)
{
    eclic_config();
    systick_init();
    platform_uart_init();

#ifdef CONFIG_RF_TEST_SUPPORT
    printf("This firmware is for WiFi & BLE rf test.\r\n");
#endif
#ifdef CONFIG_SIGNALING_TEST_SUPPORT
    printf("This firmware is for WiFi signaling test.\r\n");
#endif
#ifdef CONFIG_BLE_DTM_SUPPORT
    printf("This firmware is for BLE DTM Signaling test\r\n");
#endif

    rcu_periph_clock_enable(RCU_PMU);
    rtc_32k_config();

    // initialize rom
    rom_init();

#ifdef CFG_WLAN_SUPPORT
#ifdef CONFIG_PLATFORM_FPGA
    // Before enable wifi, we need reset wifi pll to ensure wifi work on stable clock.
    wifi_pll_reset();
#endif
    wifi_led_config();
#ifdef CFG_DMA
    dma_config();
#endif
    sysctrl_init();
#endif

#ifdef CONFIG_FATFS_SUPPORT
    rcu_periph_clock_enable(RCU_CRC);
#endif

    rf_power_on();
    raw_flash_init();
    if (nvds_flash_internal_init())
        dbg_print(ERR, "nvds flash init failed\r\n");
}
